## Plan output for service config

```

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.system.docker_image.otel has been deleted
  - resource "docker_image" "otel" {
        id            = "sha256:2104a98ea03e171255585494b787c2a92722b74a85dcb129872d3f080e66a9c8public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1"
      - name          = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1" -> null
        # (4 unchanged attributes hidden)
    }

  # module.system.docker_registry_image.otel has been deleted
  - resource "docker_registry_image" "otel" {
        id                   = "sha256:473f0b6ffbdf63f053e22e56e8db78b2c1cd7feec3902eaa93305b699c0dbc09"
      - name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.exporter.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:9ef8870704f2da7b8b12e76dd183a3348a7f0dac5401a8f462a40eeaeb9862a1207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.tools.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:7b236022beded70a37cbdd5f19cb7757365a5ac3c51df62d665cf269642f5db0207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.consumer.module.task.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:e10baefa6907b58b71db341016a3efdfa7104b38b0205509c8fc2c9b5ce303e5207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.redoer.module.task.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:b2873b15e9327044babfd6781140660a277257730b284cc7b2db357e405c93fe207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)
+/- create replacement and then destroy
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.system.aws_cloudwatch_event_target.exporter will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "exporter" {
        id             = "sqs-senzing-development-queue-empty-export-export"
        # (7 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:63" -> (known after apply)
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.system.aws_iam_role_policy.eventbridge will be updated in-place
  ~ resource "aws_iam_role_policy" "eventbridge" {
        id     = "sqs-senzing-development-eventbridge-run-task:sqs-senzing-development-eventbridge-run-task"
        name   = "sqs-senzing-development-eventbridge-run-task"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:63",
                        ]
                      - Sid      = "RunTask"
                    },
                  - {
                      - Action   = [
                          - "iam:PassRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::207495628382:role/sqs-senzing-development-exporter-execution",
                          - "arn:aws:iam::207495628382:role/sqs-senzing-development-exporter-task",
                        ]
                      - Sid      = "PassRoles"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.system.aws_ssm_parameter.senzing_config will be updated in-place
  ~ resource "aws_ssm_parameter" "senzing_config" {
        id           = "/sqs-senzing/development/senzing"
        name         = "/sqs-senzing/development/senzing"
        tags         = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
      ~ value        = (sensitive value)
      ~ value_wo     = (write-only attribute)
      ~ version      = 14 -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.system.docker_image.otel will be created
  + resource "docker_image" "otel" {
      + id            = (known after apply)
      + image_id      = (known after apply)
      + name          = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1"
      + platform      = "linux/amd64"
      + pull_triggers = [
          + "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e",
        ]
      + repo_digest   = (known after apply)
    }

  # module.system.docker_registry_image.otel will be created
  + resource "docker_registry_image" "otel" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "digest" = "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e"
        }

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.docker_tag.otel must be replaced
+/- resource "docker_tag" "otel" {
      ~ id              = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1.207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1" -> (known after apply)
      ~ source_image_id = "sha256:2104a98ea03e171255585494b787c2a92722b74a85dcb129872d3f080e66a9c8" -> (known after apply)
      ~ tag_triggers    = [ # forces replacement
          - "2025-12-18T16:47:12Z",
          - "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e",
        ] -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.system.module.exporter.data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.exporter.data.aws_ecr_authorization_token.token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_authorization_token" "token" {
      + authorization_token = (sensitive value)
      + expires_at          = (known after apply)
      + id                  = (known after apply)
      + password            = (sensitive value)
      + proxy_endpoint      = (known after apply)
      + region              = (known after apply)
      + registry_id         = "207495628382"
      + user_name           = (known after apply)
    }

  # module.system.module.exporter.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.exporter.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.system.module.exporter.aws_iam_policy.task will be updated in-place
  ~ resource "aws_iam_policy" "task" {
        id               = "arn:aws:iam::207495628382:policy/sqs-senzing-development-exporter-task"
        name             = "sqs-senzing-development-exporter-task"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/*"
                      - Sid      = "SSMAccess"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:CreateControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:OpenDataChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EcsExecAccess"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeVolumes",
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:DescribeLogGroups",
                          - "logs:DescribeLogStreams",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingTargets",
                          - "xray:PutTelemetryRecords",
                          - "xray:PutTraceSegments",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (6 unchanged attributes hidden)
    }

  # module.system.module.exporter.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "b9a2680853e0d036c24b0f4ad05066e5228abed6"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.exporter.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = (known after apply)
          + password = (sensitive value)
          + username = (known after apply)
        }
    }

  # module.system.module.tools.data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.tools.data.aws_ecr_authorization_token.token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_authorization_token" "token" {
      + authorization_token = (sensitive value)
      + expires_at          = (known after apply)
      + id                  = (known after apply)
      + password            = (sensitive value)
      + proxy_endpoint      = (known after apply)
      + region              = (known after apply)
      + registry_id         = "207495628382"
      + user_name           = (known after apply)
    }

  # module.system.module.tools.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.tools.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.system.module.tools.aws_iam_policy.task will be updated in-place
  ~ resource "aws_iam_policy" "task" {
        id               = "arn:aws:iam::207495628382:policy/sqs-senzing-development-tools-task"
        name             = "sqs-senzing-development-tools-task"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/*"
                      - Sid      = "SSMAccess"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:CreateControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:OpenDataChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EcsExecAccess"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeVolumes",
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:DescribeLogGroups",
                          - "logs:DescribeLogStreams",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingTargets",
                          - "xray:PutTelemetryRecords",
                          - "xray:PutTraceSegments",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (6 unchanged attributes hidden)
    }

  # module.system.module.tools.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "b9a2680853e0d036c24b0f4ad05066e5228abed6"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.tools.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = (known after apply)
          + password = (sensitive value)
          + username = (known after apply)
        }
    }

  # module.system.module.consumer.module.service.aws_ecs_service.main_ignore_desired_count_changes[0] will be updated in-place
  ~ resource "aws_ecs_service" "main_ignore_desired_count_changes" {
        id                                 = "arn:aws:ecs:us-west-1:207495628382:service/sqs-senzing-development/sqs-senzing-development-consumer"
        name                               = "sqs-senzing-development-consumer"
        tags                               = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer:66" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.system.module.consumer.module.task.data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.consumer.module.task.data.aws_ecr_authorization_token.token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_authorization_token" "token" {
      + authorization_token = (sensitive value)
      + expires_at          = (known after apply)
      + id                  = (known after apply)
      + password            = (sensitive value)
      + proxy_endpoint      = (known after apply)
      + region              = (known after apply)
      + registry_id         = "207495628382"
      + user_name           = (known after apply)
    }

  # module.system.module.consumer.module.task.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.consumer.module.task.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.system.module.consumer.module.task.aws_iam_policy.task will be updated in-place
  ~ resource "aws_iam_policy" "task" {
        id               = "arn:aws:iam::207495628382:policy/sqs-senzing-development-consumer-task"
        name             = "sqs-senzing-development-consumer-task"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/*"
                      - Sid      = "SSMAccess"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:CreateControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:OpenDataChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EcsExecAccess"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeVolumes",
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:DescribeLogGroups",
                          - "logs:DescribeLogStreams",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingTargets",
                          - "xray:PutTelemetryRecords",
                          - "xray:PutTraceSegments",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (6 unchanged attributes hidden)
    }

  # module.system.module.consumer.module.task.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "b9a2680853e0d036c24b0f4ad05066e5228abed6"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.consumer.module.task.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = (known after apply)
          + password = (sensitive value)
          + username = (known after apply)
        }
    }

  # module.system.module.exporter.module.ecr.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.exporter.module.ecr.data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system.module.exporter.module.ecr.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.exporter.module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "sqs-senzing-development-exporter"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::207495628382:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.system.module.exporter.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:63" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - environment            = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential              = false
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/exporter"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/otel"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - cpu                    = 1024
                  - environment            = [
                      - {
                          - name  = "EXPORT_MODE"
                          - value = "full"
                        },
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "DEBUG"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                          - value = "http://localhost:4318"
                        },
                      - {
                          - name  = "OTEL_USE_OTLP_EXPORTER"
                          - value = "true"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "sqs-senzing-development-senzing.cluster-c7qqmqeoy39j.us-west-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "Q_URL"
                          - value = "https://sqs.us-west-1.amazonaws.com/207495628382/sqs-senzing-development-queue"
                        },
                      - {
                          - name  = "RUNTIME_ENV"
                          - value = "development"
                        },
                      - {
                          - name  = "S3_BUCKET_NAME"
                          - value = "sqs-senzing-development-exports"
                        },
                    ]
                  - essential              = true
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:7d223f659f81c57c8bd2b81e71d2d218c3d35818"
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/exporter"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 4096
                  - mountPoints            = [
                      - {
                          - containerPath = "/var/log"
                          - readOnly      = false
                          - sourceVolume  = "logs"
                        },
                      - {
                          - containerPath = "/home/senzing"
                          - readOnly      = false
                          - sourceVolume  = "senzing-home"
                        },
                    ]
                  - name                   = "sqs-senzing-development-exporter"
                  - portMappings           = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:password::"
                        },
                      - {
                          - name      = "PGUSER"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:username::"
                        },
                      - {
                          - name      = "SENZING_ENGINE_CONFIGURATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/senzing"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sqs-senzing-development-exporter" -> (known after apply)
      ~ revision                 = 63 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.redoer.module.service.aws_ecs_service.main_ignore_desired_count_changes[0] will be updated in-place
  ~ resource "aws_ecs_service" "main_ignore_desired_count_changes" {
        id                                 = "arn:aws:ecs:us-west-1:207495628382:service/sqs-senzing-development/sqs-senzing-development-redoer"
        name                               = "sqs-senzing-development-redoer"
        tags                               = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer:50" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.system.module.redoer.module.task.data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.redoer.module.task.data.aws_ecr_authorization_token.token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_authorization_token" "token" {
      + authorization_token = (sensitive value)
      + expires_at          = (known after apply)
      + id                  = (known after apply)
      + password            = (sensitive value)
      + proxy_endpoint      = (known after apply)
      + region              = (known after apply)
      + registry_id         = "207495628382"
      + user_name           = (known after apply)
    }

  # module.system.module.redoer.module.task.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.redoer.module.task.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.system.module.redoer.module.task.aws_iam_policy.task will be updated in-place
  ~ resource "aws_iam_policy" "task" {
        id               = "arn:aws:iam::207495628382:policy/sqs-senzing-development-redoer-task"
        name             = "sqs-senzing-development-redoer-task"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/*"
                      - Sid      = "SSMAccess"
                    },
                  - {
                      - Action   = [
                          - "ssmmessages:CreateControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:OpenDataChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EcsExecAccess"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:PutMetricData",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeVolumes",
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:DescribeLogGroups",
                          - "logs:DescribeLogStreams",
                          - "logs:PutLogEvents",
                          - "logs:PutRetentionPolicy",
                          - "xray:GetSamplingRules",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingTargets",
                          - "xray:PutTelemetryRecords",
                          - "xray:PutTraceSegments",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (6 unchanged attributes hidden)
    }

  # module.system.module.redoer.module.task.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "b9a2680853e0d036c24b0f4ad05066e5228abed6"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.redoer.module.task.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:b9a2680853e0d036c24b0f4ad05066e5228abed6"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = (known after apply)
          + password = (sensitive value)
          + username = (known after apply)
        }
    }

  # module.system.module.tools.module.ecr.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.tools.module.ecr.data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system.module.tools.module.ecr.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.tools.module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "sqs-senzing-development-tools"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::207495628382:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.system.module.tools.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-tools:110" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-tools" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - environment            = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential              = false
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/tools"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/otel"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - cpu                    = 1024
                  - environment            = [
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "DEBUG"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                          - value = "http://localhost:4318"
                        },
                      - {
                          - name  = "OTEL_USE_OTLP_EXPORTER"
                          - value = "true"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "sqs-senzing-development-senzing.cluster-c7qqmqeoy39j.us-west-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "PGSSLMODE"
                          - value = "require"
                        },
                      - {
                          - name  = "Q_URL"
                          - value = "https://sqs.us-west-1.amazonaws.com/207495628382/sqs-senzing-development-queue"
                        },
                      - {
                          - name  = "RUNTIME_ENV"
                          - value = "development"
                        },
                      - {
                          - name  = "S3_BUCKET_NAME"
                          - value = "sqs-senzing-development-exports"
                        },
                    ]
                  - essential              = true
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:7d223f659f81c57c8bd2b81e71d2d218c3d35818"
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/tools"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 4096
                  - mountPoints            = [
                      - {
                          - containerPath = "/var/lib/amazon"
                          - readOnly      = false
                          - sourceVolume  = "aws-lib"
                        },
                      - {
                          - containerPath = "/var/log"
                          - readOnly      = false
                          - sourceVolume  = "logs"
                        },
                      - {
                          - containerPath = "/home/senzing"
                          - readOnly      = false
                          - sourceVolume  = "senzing-home"
                        },
                    ]
                  - name                   = "sqs-senzing-development-tools"
                  - portMappings           = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:password::"
                        },
                      - {
                          - name      = "PGUSER"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:username::"
                        },
                      - {
                          - name      = "SENZING_ENGINE_CONFIGURATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/senzing"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sqs-senzing-development-tools" -> (known after apply)
      ~ revision                 = 110 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "aws-lib" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "aws-lib"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.consumer.module.task.module.ecr.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.consumer.module.task.module.ecr.data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system.module.consumer.module.task.module.ecr.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.consumer.module.task.module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "sqs-senzing-development-consumer"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::207495628382:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.system.module.consumer.module.task.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer:66" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - environment            = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential              = false
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/consumer"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/otel"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - cpu                    = 1024
                  - environment            = [
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "DEBUG"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                          - value = "http://localhost:4318"
                        },
                      - {
                          - name  = "OTEL_USE_OTLP_EXPORTER"
                          - value = "true"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "sqs-senzing-development-senzing.cluster-c7qqmqeoy39j.us-west-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "Q_URL"
                          - value = "https://sqs.us-west-1.amazonaws.com/207495628382/sqs-senzing-development-queue"
                        },
                      - {
                          - name  = "RUNTIME_ENV"
                          - value = "development"
                        },
                    ]
                  - essential              = true
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:7d223f659f81c57c8bd2b81e71d2d218c3d35818"
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/consumer"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 4096
                  - mountPoints            = [
                      - {
                          - containerPath = "/var/log"
                          - readOnly      = false
                          - sourceVolume  = "logs"
                        },
                      - {
                          - containerPath = "/home/senzing"
                          - readOnly      = false
                          - sourceVolume  = "senzing-home"
                        },
                    ]
                  - name                   = "sqs-senzing-development-consumer"
                  - portMappings           = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:password::"
                        },
                      - {
                          - name      = "PGUSER"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:username::"
                        },
                      - {
                          - name      = "SENZING_ENGINE_CONFIGURATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/senzing"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sqs-senzing-development-consumer" -> (known after apply)
      ~ revision                 = 66 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.redoer.module.task.module.ecr.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.system.module.redoer.module.task.module.ecr.data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.system.module.redoer.module.task.module.ecr.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.system.module.redoer.module.task.module.ecr.aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "sqs-senzing-development-redoer"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::207495628382:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.system.module.redoer.module.task.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer:50" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command                = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - environment            = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential              = false
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/redoer"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/otel"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
              - {
                  - cpu                    = 1024
                  - environment            = [
                      - {
                          - name  = "LOG_LEVEL"
                          - value = "DEBUG"
                        },
                      - {
                          - name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                          - value = "http://localhost:4318"
                        },
                      - {
                          - name  = "OTEL_USE_OTLP_EXPORTER"
                          - value = "true"
                        },
                      - {
                          - name  = "PGHOST"
                          - value = "sqs-senzing-development-senzing.cluster-c7qqmqeoy39j.us-west-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "Q_URL"
                          - value = "https://sqs.us-west-1.amazonaws.com/207495628382/sqs-senzing-development-queue"
                        },
                      - {
                          - name  = "RUNTIME_ENV"
                          - value = "development"
                        },
                    ]
                  - essential              = true
                  - image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:7d223f659f81c57c8bd2b81e71d2d218c3d35818"
                  - linuxParameters        = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sqs-senzing/development/redoer"
                          - awslogs-region        = "us-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory                 = 4096
                  - memoryReservation      = 4096
                  - mountPoints            = [
                      - {
                          - containerPath = "/var/log"
                          - readOnly      = false
                          - sourceVolume  = "logs"
                        },
                      - {
                          - containerPath = "/home/senzing"
                          - readOnly      = false
                          - sourceVolume  = "senzing-home"
                        },
                    ]
                  - name                   = "sqs-senzing-development-redoer"
                  - portMappings           = [
                      - {
                          - containerPort = 80
                          - hostPort      = 80
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - secrets                = [
                      - {
                          - name      = "PGPASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:password::"
                        },
                      - {
                          - name      = "PGUSER"
                          - valueFrom = "arn:aws:secretsmanager:us-west-1:207495628382:secret:rds!cluster-2e4a2e07-8cf4-45ac-aec7-db2686d406d5-HPW6AD:username::"
                        },
                      - {
                          - name      = "SENZING_ENGINE_CONFIGURATION_JSON"
                          - valueFrom = "arn:aws:ssm:us-west-1:207495628382:parameter/sqs-senzing/development/senzing"
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sqs-senzing-development-redoer" -> (known after apply)
      ~ revision                 = 50 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

Plan: 15 to add, 13 to change, 5 to destroy.

Changes to Outputs:
  ~ image_tag              = "7d223f659f81c57c8bd2b81e71d2d218c3d35818" -> "b9a2680853e0d036c24b0f4ad05066e5228abed6"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```